{
  "posts": [
    {
      "post_id": "1ltjdp7",
      "title": "BMNR & RGC Explode! 🔥 Massive Moves You Can’t Miss!",
      "text": "\n🚀 $BMNR and $RGC are blasting off – and this video breaks it all down! We dive into the jaw-dropping price spikes, the catalysts behind the runs, and what to watch next. Whether you're riding the momentum or just curious, we cover:\n\n📈 BMNR’s staggering % gains\n🔍 What’s fueling the surge in RGC\n🎯 Key resistance levels & entry zones\n🔔 Risk tips & what could flip the script\n\n👉 Hit LIKE if you're hyped, COMMENT with your take, and SUBSCRIBE for daily market breakdowns!\n\nhttps://youtu.be/43-Z2T3nLlI?si=xg_F0B4iT-ayqRl1\n\n",
      "post_type": "text",
      "author_name": "Mino3621",
      "author_id": "rqvik0bj",
      "score": 2,
      "num_comments": 1,
      "created_utc": 1751857099.0,
      "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/1ltjdp7/bmnr_rgc_explode_massive_moves_you_cant_miss/"
    },
    {
      "post_id": "1ltefwz",
      "title": "Two Special Situations with Near Term Catalysts: $DATS and $HIT;\nTwo After Hours Market Movers: $MDIA, $CGTX",
      "text": "**After Hours Market Movers--$MDIA, $CGTX--on watch for potential follow through in pre-market Monday.**\n\n**DatChat  $DATS $2.62** may be one of those Special Situations that has not been recognized yet by the market-at-large. First, DATS has developed a patented technology which offers users a convenient **Photo Sharing app with User Interfaces (UI) which users can control who views those photos posted in the cloud.** When this app is launched in the next sixty days (as per the CEO in a recent public interview), the potential for the app going explosively viral is very high because users have to set up a digital photo album to be shared with those who have been invited to join that \"album\". **Yes--very unlike Facebook/Meta (FB) in a good way.**\n\nSecondly, DATS owns 34% of a pending IPO of RPM Interactive.  that is anticipated--again-- in the next sixty days.  **Press Release**:  [https://finance.yahoo.com/news/datchat-subsidiary-rpm-interactive-files-121500230.html](https://finance.yahoo.com/news/datchat-subsidiary-rpm-interactive-files-121500230.html)  DATS Current Market Cap is only $12.4 Million--so that low market cap clearly is not taking into account the value of the IPO shares\\*\\*.  A near term catalyst will be the Shareholder of Record Date that will be announced.  It would not be a surprise that traders will buy in before the shareholder of record date to participate in the spin out RPM Interactive.   DATS will still be the sole owner of Myseum (the Photo Sharing App).\n\n**Health in Technology $HIT $0.85** This look like another Special Situation/Opportunity. After its IPO in December and running to over $7.50, the stock sold off on massive volume in one (1) day to $1.25 with no news,no new SEC filing no bad press. Don't take my word for it. See the chart-- --[https://stockcharts.com/sc3/ui/?s=HIT  ](https://stockcharts.com/sc3/ui/?s=HIT%C2%A0%C2%A0) **The company's Cash position is $7.6 million as of March 31, 2025) with the market cap is $47 million, which considering that the company's revenues are growing rapidly--Quarter to Quarter--and reporting Net Income increasing over 257% over the First Quarter, 2024, it looks undervalued.**  Revenues increased 56% vs  First Quarter, 2024 to $8 Million. HIT CEO Interview was posted two weeks ago--https://www.youtube.com/watch?v=q8KsYEY7ZOQ&t=2039s  Corporate Description: HIT's Insurtech platform company, backed by third-party AI technology, offers a marketplace to improve processes in the healthcare industry through vertical integration, process simplification, and automation. By removing friction and complexities, HIT streamlines the underwriting, sales and service process for insurance companies, licensed brokers. Recent Research Report has $2.50 Target Price.\n\n*Due diligence is always necessary to make informed investment decisions. So take these ideas as a starting point and not your entire due diligence effort.*",
      "post_type": "text",
      "author_name": "Marketspike",
      "author_id": "a159k26r",
      "score": 3,
      "num_comments": 0,
      "created_utc": 1751842187.0,
      "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/1ltefwz/two_special_situations_with_near_term_catalysts/"
    },
    {
      "post_id": "1ltcd94",
      "title": "Investment Opportunity of a Lifetime - $215M Mid Cap about to Announce 2 Trial Results each worth 20X the Current Market Value.",
      "text": "[https://stocktwits.com/Gps\\_100X\\_ROI\\_Potential/message/619753316](https://stocktwits.com/Gps_100X_ROI_Potential/message/619753316) \n\n\n\n[$SLS](https://stocktwits.com/symbol/SLS) will SLS be worth a few pennies more or less tomorrow? \n\nIDRK, but I do know, SLS will absoFreakinLutely be worth MANY DOLLARS MORE \n\n\\- ANY DAY NOW \n\n\\- When We Get and the Whole Market Sees the FDA Registrational Phase 3 Trial Results for Gps Immunotherapy and the SLS009/ Tambiciclib FDA Accelerated Approval Announcement.    \n   \nGps and SLS009/TambiCiclib are both worth Many Billions, and likely +$10B each to Big Pharma - the \"market pricing\", is just beginning to appreciate and reflect that value.   \n   \nNo Real Investors currently Holding are Letting any Go - with the FDA Registrational Results getting Announced Any Day Now.  \n\n  \nYou will Kick yourself For Not ADDING AS MANY AS YOU CAN... \n\n  \nFOR Those of US ALL IN, BALL DEEP - Congrats - this is about double a couple times, even withOUT News, the potential Value is Ginormous compared to the short rigged mcap.   \n\\- YOLO -- Degen Mode on [$SLS](https://stocktwits.com/symbol/SLS) Right Now for Massive ROI.   \n\\- mark this post.\n\nhttps://preview.redd.it/scqfhjtwlbbf1.jpg?width=1320&format=pjpg&auto=webp&s=c3ea4367cbcb7633201b3d62f8d9e3d410b0cc57\n\nhttps://preview.redd.it/hbtzqgtwlbbf1.jpg?width=1308&format=pjpg&auto=webp&s=8c1b5275eebaf661032379fbcb76b55f535353c8\n\n",
      "post_type": "text",
      "author_name": "Run4theRoses2",
      "author_id": "60p5ejtz",
      "score": 5,
      "num_comments": 0,
      "created_utc": 1751836724.0,
      "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/1ltcd94/investment_opportunity_of_a_lifetime_215m_mid_cap/"
    },
    {
      "post_id": "1lsi2f1",
      "title": "AGMH Maby look at this?",
      "text": "\n\nAGMH signed a deal to sell a subsidiary for $57M, with the first payment (20%) due by July 10. The company has strengthened its board and increased the CEO’s voting power—often a sign that a major event is nearing. Market cap is still under $5M (!). If the deal closes, $25–30 per share could be justified based on cash value alone.\nAGMH signed a deal to sell a subsidiary for $57M, with the first payment (20%) due by July 10. The company has strengthened its board and increased the CEO’s voting power—often a sign that a major event is nearing. Market cap is still under $5M (!). If the deal closes, $25–30 per share could be justified based on cash value alone.",
      "post_type": "text",
      "author_name": "mariusvell",
      "author_id": "nspvrhts",
      "score": 30,
      "num_comments": 0,
      "created_utc": 1751744023.0,
      "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/1lsi2f1/agmh_maby_look_at_this/"
    },
    {
      "post_id": "1lsacg0",
      "title": "Why invest in handsome?",
      "text": "So why invest in handsome… in beautiful… in brave?\n\nWarren Buffett said he would never bet against America… Why?  \n\nLet’s start with the fact that it is called beautiful… and a promise of a home for those who are brave…\n\nThose who struggle through the darkness… to make the world a new… the better angels who create a kinder world for all walks of life no matter where they started… anything is possible… if you don’t give up… \n\nIn a world economy of rum… sugar… and tea… built with a force function of slavery… it wasn’t inevitable it had to stay in the darkness… it could change.  \n\nAlthough we could avoid a violent revolution followed by a civil war this time around… \n\nA modern economy with a force function of AI could be built around the light of our best selves… a universal access to basic food and housing… to income… and like in the parable of talents… some could invest it… in a new triangle trade of technology… real estate… and MainStreet…\n\nor\n\nNone of that will happen… \n\nBut the fact that you thought it could… that means you’re brave….  \n\n",
      "post_type": "text",
      "author_name": "Future_Fund2025",
      "author_id": "1ivpzm4bpm",
      "score": 0,
      "num_comments": 2,
      "created_utc": 1751723437.0,
      "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/1lsacg0/why_invest_in_handsome/"
    },
    {
      "post_id": "1lrjd7q",
      "title": "Grandmaster Obi’s $2.5M BMNR Rocket—And Why You Couldn’t Join",
      "text": "Read more here: \n\nhttps://webulls-newsletter.beehiiv.com/p/1-000-into-26-000-in-72-hours-grandmaster-obi-s-2-539-bmnr-moonshot-and-you-can-t-join-his-server-an",
      "post_type": "text",
      "author_name": "Mino3621",
      "author_id": "rqvik0bj",
      "score": 18,
      "created_utc": 1751637384.0,
      "num_comments": 31,
      "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/1lrjd7q/grandmaster_obis_25m_bmnr_rocketand_why_you/"
    },
    {
      "post_id": "1lra055",
      "title": "$1,000 into $26,000 in 72 Hours”—Grandmaster-OBI’s 2,539% BMN.",
      "text": "In what may be the single most explosive retail-trading alert of the year, Grandmaster-OBI of the Making Easy Money Stock Market Alert Server on Discord pinpointed BitMine Immersion Technologies (BMNR) at $6.10 on June 30—and by today’s session peak it blasted all the way to $161, delivering an eye-popping 2,539% surge in just three trading.\n\nhttps://webulls-newsletter.beehiiv.com/p/1-000-into-26-000-in-72-hours-grandmaster-obi-s-2-539-bmnr-moonshot-and-you-can-t-join-his-server-an",
      "post_type": "text",
      "author_name": "Basic_Meet_9096",
      "author_id": "j9l82tnvl",
      "score": 0,
      "created_utc": 1751604067.0,
      "num_comments": 1,
      "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/1lra055/1000_into_26000_in_72_hoursgrandmasterobis_2539/"
    },
    {
      "post_id": "1lqu0g6",
      "title": "Wall Street Values a $12 M Robot Line at Zero—The $WKSP Disconnect You Can Trade",
      "text": "Worksport spent $11.9 million automating its New York plant, slashing per-unit labor costs by 70 % and trimming lead times to ten days. Yet the company’s $20 million market cap suggests that hard asset is worth—checks math—almost nothing.\n\n\n\nHere’s the reality:\n\n\n\nFactory output can scale to 250,000 covers annually without fresh cap-ex.\n\n\n\nTariff-free U.S. production beats importers by 15–18 % landed cost.\n\n\n\nGross margin climbed from 7 % to 23 % in 15 months and targets 30 % by December.\n\n\n\nAt $3.318, you’re effectively buying the robotics at book value and getting the growth—dealer expansion, fleet pilots, SOLIS tech—for free. Markets eventually fix math errors; the question is whether you’re holding shares when they do.",
      "post_type": "text",
      "author_name": "3421431boom",
      "author_id": "766ues2",
      "score": 10,
      "created_utc": 1751560157.0,
      "num_comments": 2,
      "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/1lqu0g6/wall_street_values_a_12_m_robot_line_at_zerothe/"
    },
    {
      "post_id": "1lqklhe",
      "title": "Musk’s xAI received $10 billion in financing",
      "text": "On July 3, Morgan Stanley posted on the overseas social media X that Elon Musk’s xAI has completed $5 billion (about RMB 35.8 billion) in debt financing and another $5 billion (about RMB 35.8 billion) in strategic equity financing.\n\n\n\nWith new financing, xAI’s valuation exceeded one trillion  \nIn addition to debt financing, xAI is also negotiating about $20 billion in equity financing, which will value the company at more than $120 billion. The transaction was oversubscribed, and the participants included several well-known global debt investors. The funds raised will be used to develop AI solutions, including the construction of data centers and updates and upgrades to xAI’s flagship platform Grok.  \nIt is reported that xAI was founded by Musk in July 2023, and most of the company’s employees come from giants such as OpenAI, Google DeepMind, Microsoft, and Tesla. Competition in Silicon Valley has entered a white-hot stage. In order to make it compete directly with ChatGPT, Musk has devoted most of his energy in the past two years to xA. They are already developing the Grok 4 artificial intelligence model.\n\n\n\nAmazon releases new AI big model  \nAt the same time, Amazon (AMZN), a global e-commerce and cloud computing giant, announced on its official website two important milestones in the field of robotics and AI: the launch of a new AI basic big model Deep Fleet, and the number of deployed robots exceeded the 1 million mark.\n\nRecently, Baidu (BIDU) officially open-sourced the Wenxin big model 4.5 series models, covering 10 models such as the mixed expert (MoE) model with 47B and 3B activation parameters and the dense model with 0.3B parameters, and realized the complete open source of pre-training weights and inference code.  \nAt present, the Wenxin big model 4.5 open source series can be downloaded and deployed on platforms such as the PaddlePaddle Galaxy Community and HuggingFace. At the same time, the open source model API service can also be used on the Baidu Smart Cloud Qianfan big model platform.  \nAccording to foreign media sources, Apple (AAPL) is considering abandoning its self-developed internal model and using Anthropic or OpenAI’s artificial intelligence (AI) technology to drive the new version of Siri. People familiar with the matter revealed that Apple has contacted the two companies to discuss deploying their large language models (LLM) on Apple’s own cloud infrastructure for testing.\n\nWiMi AI industry enters a new stage of application  \nAt the same time, facing the surging AI wave, data shows that AI visual innovation manufacturer Wimi Hologram Cloud Inc (WIMI) has formed a differentiated competitive advantage with its artificial intelligence large model based on years of technological accumulation, promoting the transformation of large models into inclusive fusion innovation infrastructure, and continuously improving its independent innovation ecology, accelerating the penetration of AI technology into the production end.  \nIn addition, WiMi promotes the innovation of base large models through an open source model, continuously promotes the development of multimodal large models, supports the fusion analysis of multiple types of data such as voice, image, and video, and plans to launch a higher-precision reasoning model to promote the “technology-data-scenario” cycle iteration, lower the threshold for use by small and medium-sized enterprises, and provide extensive support for scenarios such as smart manufacturing and smart cities.",
      "post_type": "text",
      "author_name": "Independent-Rise-227",
      "author_id": "kjggaurs",
      "score": 5,
      "created_utc": 1751532374.0,
      "num_comments": 1,
      "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/1lqklhe/musks_xai_received_10_billion_in_financing/"
    },
    {
      "post_id": "1lpzhkd",
      "title": "One Micro-Cap, Two FDA Shots: Colorectal and Pancreatic Early Detection for $1.39",
      "text": "At today’s $1.39 close, Mainz Biomed offers a two-for-one catalyst package rarely seen below a ten-million-dollar market cap. First, the big one: ReconAAsense, a 15 000-patient colorectal-cancer pivotal built on mRNA biomarkers that already outperformed Cologuard in pilot studies. Interim data drop late next year.\n\n\n\nSecond, the PancAlert blood test. Discovery work shows 95 percent sensitivity for pancreatic cancer—a disease with almost no early-detection market entrants. ISB’s 50-percent grant pays half the feasibility tab, lowering burn and raising odds of a partner deal if numbers hold.\n\n\n\nTwo independent readouts land within an 18-month window. Any positive headline could double a micro-float trading near cash. And because cash burn (\\~$12 million per year) is partly offset by grants and modest ColoAlert EU revenue, dilution between now and the catalysts looks minimal.\n\n\n\nLow float, dual trial path, and state money in the bank—$1.39 feels like optionality priced in pennies.\n\n\n\nDo your own DD; biotech timelines can slip and trials can fail.",
      "post_type": "text",
      "author_name": "3421431boom",
      "author_id": "766ues2",
      "score": 27,
      "created_utc": 1751471661.0,
      "num_comments": 0,
      "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/1lpzhkd/one_microcap_two_fda_shots_colorectal_and/"
    }
  ],
  "last_post_id": "1lpzhkd",
  "saved_at": "2025-07-07T11:21:05.954262",
  "total_posts": 10
}